{"recCZCvAm5nnJ0cBI":{"title":"History - How CONVERGE came to be","body":"Our history is that...","style":"top"},"reckJ9jI0cRnjRRKb":{"title":"What to Expect","body":"You can expect several things when you JOIN US for worship:\n\nOur style of worship is more contemporary, with a sensitivity to the Holy Spirit’s leading. We tend to be a little more on the quiet, reflective side, but we are open to learning new ways to express our love for God and others.\n\nWe enjoy a good conversation and listening to others, even if we disagree. So, if you are not familiar with Christianity or following Jesus, we are glad to meet you where you are, even in the context of the worship services. Our hope is that you would feel valued and respected, and that you will be able to further grasp even a glimpse of how much God loves you, regardless of where you are in your spiritual journey.\n\nOur coffee bar, He brews is open from 10:30a to 11:15p, providing space to converse and enjoy wonderful refreshment.","style":"right"},"recBIc5OzArrkVPFE":{"title":"What We Believe","body":"The Triune God — Father, Son, and Holy Spirit.\n\nJesus Christ as Lord and Savior and the Gospel as the power of God for the salvation of all who believe.\n\nJesus Christ is the Word of God incarnate, through whom everything was made and through whose life, death, and resurrection God fashions a new creation.\n\nThe proclamation of God’s message to us as both Law and Gospel is the Word of God, revealing judgment and mercy through word and deed, beginning with the Word in creation, continuing in the history of Israel, and centering in all its fullness in the person and work of Jesus Christ.\n\nThe canonical Scriptures of the Old and New Testaments are the written Word of God. Inspired by the Holy Spirit speaking through their authors, they record and announce God’s revelation centering in Jesus Christ. Through them the Holy Spirit speaks to us to create and sustain Christian faith and fellowship for service in the world.\n\nGod:\nWe are people who believe and confess our faith in the Triune God — Father, Son, and Holy Spirit. We trust and believe in Jesus Christ as our Savior and Lord.\n\nHumanity:\nWe believe that all humanity possesses dignity, since God created all in His image, male and female, to glorify Him.\n\nSalvation:\nWe believe and confess that all human beings are sinners, and that sinners are redeemed by the death and resurrection of Jesus Christ. God alone justifies human beings by faith in Christ — a faith that God creates through the message of the Gospel. As ambassadors for Christ, God uses us to speak his Word and build his kingdom.\n\nThe Church:\nWe believe and confess that the church is the assembly of believers called and gathered by God around Word and Sacrament, and that the mission and ministry of the church is carried out within the context of individual congregations, which are able to work together locally and globally.\n\nThe Future:\nWe believe that, at a day and hour only known by God, our Lord Jesus Christ shall come again.\n\nThe Word:\nWe believe that the Bible, inspired by the Holy Spirit, is the Word of God, and is our rule of faith and life.","style":"left"},"recXkRbfvnjP8JJLW":{"title":"CORE Values","body":"Community:\nCommitted to bridging ages, socio-economic status, race, and culture\n\nDiscipleship:\nTraining up disciples in reverence for God, who become servant-leaders who, in turn, train up the next generation of such disciples.\n\nGod Central:\nWe confess the apostolic faith in Jesus Christ according to the Holy Scriptures. God is central and at the heart of all we are and do\n\nMissions:\nWe believe that the mission of the Church is to preach the Gospel and to make disciples for Christ. Sharing Christ’s message of hope and reconciliation locally and abroad.\n\nServing:\nServing God and our community in His love according to our calling and spiritual gift-mix\n\nTraditionally Grounded:\nWe affirm the ecumenical creeds and the faithful witness of the Church across time and space.","style":"left"},"recuRIUNzyz0XKv2X":{"title":"Where We Are Located","body":"We are located in the heart of Liliha. Come visit us!!","img":[{"id":"attlv1SkIkGkSjthN","url":"https://dl.airtable.com/eSqDLp1RSCChf9syMZFq_Y01VDYAX63.jpg","filename":"Y01VDYAX63.jpg","size":63704,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/UOg9cNpMRJqCVzxM6lmd_small_Y01VDYAX63.jpg","width":54,"height":36},"large":{"url":"https://dl.airtable.com/xzfJvxUWRxiU7FxwF8Pf_large_Y01VDYAX63.jpg","width":512,"height":512},"full":{"url":"https://dl.airtable.com/qPMVjqiFRNWDZmn0fVvq_full_Y01VDYAX63.jpg","width":960,"height":641}}},{"id":"atthpwjNBK4AIRyma","url":"https://dl.airtable.com/n1dr4vYJRLOZW6MHLjeU_Church%20Locale.png","filename":"Church Locale.png","size":17775896,"type":"image/png","thumbnails":{"small":{"url":"https://dl.airtable.com/fYxVGf1ASmaLDw4UKkgJ_small_Church%20Locale.png","width":70,"height":36},"large":{"url":"https://dl.airtable.com/CksRppYTUC43UY2ec7ZA_large_Church%20Locale.png","width":512,"height":512},"full":{"url":"https://dl.airtable.com/3cPqS2FRnKRbXjLrijHR_full_Church%20Locale.png","width":3000,"height":1537}}}],"style":"right"},"recRMvl35cMSNlBv2":{"title":"Youth CONVERGE","body":"The Youth CONVERGE is...","style":"right"},"rec0l7oUovIP8Fl2X":{"title":"CoYA CONVERGE","body":"The CoYA CONVERGE is...","style":"top"}}
